from controller import run

if __name__ == "__main__":
    print("==============================================")
    print("   Консольний застосунок для роботи з БД PostgreSQL")
    print("   Автор: Фіалковська Ольга, група КВ-34")
    print("==============================================")
    print("Програма підключається до бази даних...")
    print()

    try:
        run()
    except KeyboardInterrupt:
        print("\nПрограму завершено користувачем.")
    except Exception as e:
        print("❌ Виникла помилка під час виконання програми:", e)
